// 6️⃣ Соединить массив слов в строку через дефис
// (без использования .join('-') в первом способе)

// 🔹 Пример
// ["I", "love", "JS"] → "I-love-JS"

// 💡 Способы (минимум 2–3)
// 1️⃣ Через for
// 2️⃣ Через while
// 3️⃣ Через reduce
// (потом можно сравнить с .join())

// 🔎 Подсказка для цикла
// Перебираем массив
// Добавляем элемент к строке
// Если это не последний элемент → добавляем -
// Важно не добавить лишний дефис в конце

// Алгоритм:
// Создаём пустую строку
// Проходим по массиву
// Добавляем слово + - (кроме последнего)
// Возвращаем результат
// Альтернатива: join('-')

// 1️⃣ Через for
const newArr = ['I', 'love', 'JS'];

const hyphenatedStringFor = (arr) => {
  let hyphenatedLine = '';

  for (let i = 0; i < arr.length; i++) {
    if (i !== arr.length - 1) {
      hyphenatedLine += `${arr[i]}-`;
    }
    hyphenatedLine += arr[i];
  }
  return hyphenatedLine;
};
// for (let i = 0; i < arr.length; i++) {
//   hyphenatedLine += arr[i] + (i < arr.length - 1 ? '-' : '');
// }
// Пока i меньше последнего индекса → добавляем дефис
// Когда i равен последнему индексу → не добавляем дефис

// console.log(hyphenatedStringFor(newArr));

// 2️⃣ Через while
const hyphenatedStringWhile = (arr) => {
  let hyphenatedLine = '';
  let i = 0;

  while (i < arr.length) {
    hyphenatedLine += arr[i] + (i < arr.length - 1 ? '-' : '');
    i++;
  }
  return hyphenatedLine;
};
// while (i < arr.length) {
//   hyphenatedLine += arr[i];          // добавляем слово

//   if (i < arr.length - 1) {          // если не последний
//     hyphenatedLine += '-';           // добавляем дефис
//   }

//   i++;                               // увеличиваем индекс
// }

// console.log(hyphenatedStringWhile(newArr));

// 3️⃣ способ через reduce
const hyphenatedStringReduce = (arr) => {
  return arr.reduce((acc, el, i) => {
    return acc + el + (i < arr.length - 1 ? '-' : '');
  }, '');
};

// console.log(hyphenatedStringReduce(newArr));

// В reduce всегда возвращаем acc
// Чтобы знать позицию элемента — используем третий параметр index

// Самый простой способ — .join('-')
const hyphenatedStringJoin = (arr) => {
  return arr.join('-');
};

console.log(hyphenatedStringJoin(['I', 'love', 'JS']));
// "I-love-JS"

// 🧠 Что делает join
// arr.join('-')

// Берёт массив
// Склеивает элементы в строку
// Между элементами вставляет -
// Сам контролирует, чтобы не было лишнего дефиса

// ⚖ Сравнение подходов
// Способ	      Сложность	              Когда использовать
// for         	Средняя	                Когда нельзя использовать методы
// while	      Средняя	                Для тренировки циклов
// reduce	      Выше	                  Когда нужно функциональное решение
// join	        Самый простой	          В реальной работе ✅
